const fs = require("fs");
let المعرف_الحالي = 0;
let عنوان_الصفحة = "غير مٌعنون";
let شعار_الصفحة = "";

function صفحة(المحتوى = { العنوان: عنوان_الصفحة, العناصر: [] }) {
    const المعرف = `صفحة${++المعرف_الحالي}`;
    let الشفرة = `\nconst ${المعرف} = document.createElement('div');`;
    الشفرة += `\n${المعرف}.className = 'Page';`;

    for (let ب = 0; ب < المحتوى["العناصر"].length; ب++) {
        الشفرة += `\n${المحتوى["العناصر"][ب]["الشفرة"]}`;
        الشفرة += `\n${المعرف}.appendChild(${المحتوى["العناصر"][ب]["متغير"]});`;
    }

    return { الشفرة: الشفرة, متغير: المعرف };
}

function نص(
    النص = "",
    المحتوى = { اللون: "", الحجم: "", السمك: "", الاسم: "" }
) {
    const المعرف = `نص${++المعرف_الحالي}`;
    let الشفرة = `\nconst ${المعرف} = document.createElement('p');`;
    الشفرة += `\n${المعرف}.textContent = '${النص}';`;
    الشفرة += `\n${المعرف}.style.color = '${المحتوى["اللون"]}';`;
    الشفرة += `\n${المعرف}.style.fontSize = '${المحتوى["الحجم"]}';`;
    الشفرة += `\n${المعرف}.style.fontWeight = '${المحتوى["السمك"]}';`;
    الشفرة += `\n${المعرف}.style.fontFamily = '${المحتوى["الاسم"]}';`;

    return { الشفرة: الشفرة, متغير: المعرف };
}

function رأسي(
    المحتوى = [],
    التصميم = {
        محاذاة_الرأسي: "space-between",
        محاذاة_العمود: "center",
        الخلفية: "",
        الحشو: "0",
        الهامش: "0",
        العرض: "",
        الارتفاع: "",
    }
) {
    const المعرف = `رأسي${++المعرف_الحالي}`;
    let الشفرة = `\nconst ${المعرف} = document.createElement('div');`;
    الشفرة += `\n${المعرف}.className = 'Column';`;
    الشفرة += `\n${المعرف}.style.display = 'flex';`;
    الشفرة += `\n${المعرف}.style.flexDirection = 'column';`;
    الشفرة += `\n${المعرف}.style.justifyContent = '${التصميم["محاذاة_الرأسي"]}';`;
    الشفرة += `\n${المعرف}.style.alignItems = '${التصميم["محاذاة_العمود"]}';`;
    الشفرة += `\n${المعرف}.style.padding = '${التصميم["الحشو"]}px';`;
    الشفرة += `\n${المعرف}.style.margin = '${التصميم["الهامش"]}px';`;
    الشفرة += `\n${المعرف}.style.width = '${التصميم["العرض"]}px';`;
    الشفرة += `\n${المعرف}.style.height = '${التصميم["الارتفاع"]}px';`;
    الشفرة += `\n${المعرف}.style.backgroundColor = '${التصميم["الخلفية"]}';`;

    for (let ب = 0; ب < المحتوى.length; ب++) {
        الشفرة += `\n${المحتوى[ب]["الشفرة"]}`;
        الشفرة += `\n${المعرف}.appendChild(${المحتوى[ب]["متغير"]});`;
    }

    return { الشفرة: الشفرة, متغير: المعرف };
}

function أفقي(
    المحتوى = [],
    التصميم = {
        محاذاة_الرأسي: "space-between",
        محاذاة_العمود: "center",
        الخلفية: "",
        الحشو: "0",
        الهامش: "0",
        العرض: "",
        الارتفاع: "",
    }
) {
    const المعرف = `أفقي${++المعرف_الحالي}`;
    let الشفرة = `\nconst ${المعرف} = document.createElement('div');`;
    الشفرة += `\n${المعرف}.className = 'Row';`;
    الشفرة += `\n${المعرف}.style.display = 'flex';`;
    الشفرة += `\n${المعرف}.style.flexDirection = 'row';`;
    الشفرة += `\n${المعرف}.style.justifyContent = '${التصميم["محاذاة_الرأسي"]}';`;
    الشفرة += `\n${المعرف}.style.alignItems = '${التصميم["محاذاة_العمود"]}';`;
    الشفرة += `\n${المعرف}.style.padding = '${التصميم["الحشو"]}px';`;
    الشفرة += `\n${المعرف}.style.margin = '${التصميم["الهامش"]}px';`;
    الشفرة += `\n${المعرف}.style.width = '${التصميم["العرض"]}px';`;
    الشفرة += `\n${المعرف}.style.height = '${التصميم["الارتفاع"]}px';`;
    الشفرة += `\n${المعرف}.style.backgroundColor = '${التصميم["الخلفية"]}';`;

    for (let ب = 0; ب < المحتوى.length; ب++) {
        الشفرة += `\n${المحتوى[ب]["الشفرة"]}`;
        الشفرة += `\n${المعرف}.appendChild(${المحتوى[ب]["متغير"]});`;
    }

    return { الشفرة: الشفرة, متغير: المعرف };
}

function بطاقة(
    المحتوى = [],
    التصميم = {
        محاذاة_الرأسي: "space-between",
        محاذاة_العمود: "start",
        الخلفية: "",
        الحشو: "10",
        الهامش: "10",
        العرض: "",
        الارتفاع: "",
    }
) {
    const المعرف = `بطاقة${++المعرف_الحالي}`;
    let الشفرة = `\nconst ${المعرف} = document.createElement('div');`;
    الشفرة += `\n${المعرف}.className = 'GlassBG';`;
    الشفرة += `\n${المعرف}.style.display = 'flex';`;
    الشفرة += `\n${المعرف}.style.flexDirection = 'column';`;
    الشفرة += `\n${المعرف}.style.justifyContent = '${التصميم["محاذاة_الرأسي"]}';`;
    الشفرة += `\n${المعرف}.style.alignItems = '${التصميم["محاذاة_العمود"]}';`;
    الشفرة += `\n${المعرف}.style.padding = '${التصميم["الحشو"]}px';`;
    الشفرة += `\n${المعرف}.style.margin = '${التصميم["الهامش"]}px';`;
    الشفرة += `\n${المعرف}.style.width = '${التصميم["العرض"]}px';`;
    الشفرة += `\n${المعرف}.style.height = '${التصميم["الارتفاع"]}px';`;
    الشفرة += `\n${المعرف}.style.backgroundColor = '${التصميم["الخلفية"]}';`;

    for (let ب = 0; ب < المحتوى.length; ب++) {
        الشفرة += `\n${المحتوى[ب]["الشفرة"]}`;
        الشفرة += `\n${المعرف}.appendChild(${المحتوى[ب]["متغير"]});`;
    }

    return { الشفرة: الشفرة, متغير: المعرف };
}

function ابدأ(المحتوى) {
    let الشفرة = `<!DOCTYPE html><html lang="ar" dir="rtl"><head><meta charset="UTF-8" /><meta name="viewport" content="width=device-width, initial-scale=1.0" /><meta name="description" content="" /><meta name="keywords" content="alif,aliflang,alifweb,الف, الف ويب" /><link rel="stylesheet" href="اساسي.css"><link rel="icon" href=""><title></title></head><body><div id="root"></div><script>const __fragment = document.getElementById("root");`;

    let شفرة_الموقع = الشفرة + المحتوى["الشفرة"];
    شفرة_الموقع += `\n__fragment.appendChild(${المحتوى["متغير"]});`;
    شفرة_الموقع += `\ndocument.title = '${عنوان_الصفحة}';`;
    شفرة_الموقع += `\ndocument.querySelector('link[rel="icon"]').href = '${شعار_الصفحة}';`;
    شفرة_الموقع += "</script></body></html>";

    fs.writeFileSync("index.html", شفرة_الموقع);
    return شفرة_الموقع;
}

ابدأ(
    صفحة({
        العنوان: "الواجهه",
        العناصر: [
            نص("مرحبا في الواجهه"),
            نص("مرحبا في الواجهه"),
            بطاقة([
                نص("مرحبا في الواجهه"),
                نص("مرحبا في الواجهه"),
                أفقي([نص("مرحبا في الواجهه"), نص("مرحبا في الواجهه")]),
            ]),
        ],
    })
);
